In [1]:
# Add Matplotlib inline magic command
%matplotlib inline
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd
import statistics
import numpy as np
import scipy.stats as sts
import datetime


# File to Load (Remember to change these)
city_data_to_load = "Resources/city_data.csv"
ride_data_to_load = "Resources/ride_data.csv"

# Read the City Data and Print head
city_data_df = pd.read_csv(city_data_to_load)
city_data_df.head(10)

            city  driver_count   type
0    Richardfort            38  Urban
1   Williamsstad            59  Urban
2    Port Angela            67  Urban
3     Rodneyfort            34  Urban
4    West Robert            39  Urban
5   West Anthony            70  Urban
6    West Angela            48  Urban
7  Martinezhaven            25  Urban
8      Karenberg            22  Urban
9    Barajasview            26  Urban

In [2]:
# Read the Ride data and print head
ride_data_df = pd.read_csv(ride_data_to_load)
ride_data_df.head(10)

                 city             date   fare        ride_id
0  Lake Jonathanshire  1/14/2019 10:14  13.83  5739410935873
1  South Michelleport   3/4/2019 18:24  30.24  2343912425577
2  Port Samanthamouth   2/24/2019 4:29  33.44  2005065760003
3          Rodneyfort  2/10/2019 23:22  23.44  5149245426178
4          South Jack    3/6/2019 4:28  34.58  3908451377344
5        South Latoya  3/11/2019 12:26   9.52  1994999424437
6       New Paulville  2/27/2019 11:17  43.25   793208410091
7        Simpsonburgh   4/26/2019 0:43  35.98   111953927754
8     South Karenland    1/8/2019 3:28  35.09  7995623208694
9       North Jasmine    3/9/2019 6:26  42.81  5327642267789

In [3]:
# Combine the data into a single dataset
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])

# Display the data table for preview
pyber_data_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,1/14/2019 10:14,13.83,5739410935873,5,Urban
1,South Michelleport,3/4/2019 18:24,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2/24/2019 4:29,33.44,2005065760003,57,Urban
3,Rodneyfort,2/10/2019 23:22,23.44,5149245426178,34,Urban
4,South Jack,3/6/2019 4:28,34.58,3908451377344,46,Urban

In [4]:
#  1. Get the total rides for each city type
total_rides_by_type=pyber_data_df.groupby(["type"]).count()["ride_id"]
total_rides_by_type

type
Rural        125
Suburban     625
Urban       1625
Name: ride_id, dtype: int64

In [5]:
# 2. Get the total drivers for each city type
total_drivers_by_type=city_data_df.groupby(["type"]).sum()["driver_count"]
total_drivers_by_type

type
Rural         78
Suburban     490
Urban       2405
Name: driver_count, dtype: int64

In [6]:
#  3. Get the total amount of fares for each city type
total_fares_by_type=pyber_data_df.groupby(["type"]).sum()["fare"]
total_fares_by_type

type
Rural        4327.93
Suburban    19356.33
Urban       39854.38
Name: fare, dtype: float64

In [7]:
#  4. Get the average fare per ride for each city type. 
Avg_fare_per_ride=total_fares_by_type/total_rides_by_type
Avg_fare_per_ride

type
Rural       34.623440
Suburban    30.970128
Urban       24.525772
dtype: float64

In [8]:
# 5. Get the average fare per driver for each city type.
Avg_fare_per_driver=total_fares_by_type/total_drivers_by_type
Avg_fare_per_driver

type
Rural       55.486282
Suburban    39.502714
Urban       16.571468
dtype: float64

In [9]:
#  6. Create a PyBer summary DataFrame.
pyber_summary_df=pd.DataFrame({"Total Rides":total_rides_by_type.map("{:,}".format),
                               "Total Drivers":total_drivers_by_type.map("{:,}".format),
                               "Total fares":total_fares_by_type.map("${:,.2f}".format),
                               "Average Fare per Ride":Avg_fare_per_ride.map("${:,.2f}".format),
                               "Average Fare per Driver":Avg_fare_per_driver.map("${:,.2f}".format)})
pyber_summary_df

,Total Rides,Total Drivers,Total fares,Average Fare per Ride,Average Fare per Driver
type,,,,,
Rural,125,78,"$4,327.93",$34.62,$55.49
Suburban,625,490,"$19,356.33",$30.97,$39.50
Urban,"1,625","2,405","$39,854.38",$24.53,$16.57

In [10]:
#  7. Cleaning up the DataFrame. Delete the index name
pyber_summary_df.index.name = None
#PyBer_Summary_df.drop([0, 1])

#Del PyBer_Summary_df.index.type Ask Andrew
#del df.columns.name
pyber_summary_df

,Total Rides,Total Drivers,Total fares,Average Fare per Ride,Average Fare per Driver
Rural,125,78,"$4,327.93",$34.62,$55.49
Suburban,625,490,"$19,356.33",$30.97,$39.50
Urban,"1,625","2,405","$39,854.38",$24.53,$16.57

In [12]:
#  8. Format the columns.
pyber_data_df = pyber_data_df.rename(columns =
                                     {"city": "City",
                                     "date": "Date", 
                                     "fare": "Fare", 
                                     "ride_id": "Ride Id",
                                     "driver_count": "No. Drivers",
                                     "type": "City Type"})

pyber_data_df.head(10)

,City,Date,Fare,Ride Id,No. Drivers,City Type
0,Lake Jonathanshire,1/14/2019 10:14,13.83,5739410935873,5,Urban
1,South Michelleport,3/4/2019 18:24,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2/24/2019 4:29,33.44,2005065760003,57,Urban
3,Rodneyfort,2/10/2019 23:22,23.44,5149245426178,34,Urban
4,South Jack,3/6/2019 4:28,34.58,3908451377344,46,Urban
5,South Latoya,3/11/2019 12:26,9.52,1994999424437,10,Urban
6,New Paulville,2/27/2019 11:17,43.25,793208410091,44,Urban
7,Simpsonburgh,4/26/2019 0:43,35.98,111953927754,21,Urban
8,South Karenland,1/8/2019 3:28,35.09,7995623208694,4,Urban
9,North Jasmine,3/9/2019 6:26,42.81,5327642267789,33,Urban

In [ ]:
# 1. Read the merged DataFrame

In [14]:
# 2. Using groupby() to create a new DataFrame showing the sum of the fares 
#  for each date where the indices are the city type and date.

In [ ]:
# 3. Reset the index on the DataFrame you created in #1. This is needed to use the 'pivot()' function.
# df = df.reset_index()

In [ ]:
# 4. Create a pivot table with the 'date' as the index, the columns ='type', and values='fare' 
# to get the total fares for each type of city by the date.

In [ ]:
# 5. Create a new DataFrame from the pivot table DataFrame using loc on the given dates, '2019-01-01':'2019-04-29'.

In [ ]:
# 6. Set the "date" index to datetime datatype. This is necessary to use the resample() method in Step 8.
# df.index = pd.to_datetime(df.index)

In [ ]:
# 7. Check that the datatype for the index is datetime using df.info()

In [ ]:
# 8. Create a new DataFrame using the "resample()" function by week 'W' and get the sum of the fares for each week.

In [ ]:
# 8. Using the object-oriented interface method, plot the resample DataFrame using the df.plot() function. 

# Import the style from Matplotlib.
from matplotlib import style
# Use the graph style fivethirtyeight.
style.use('fivethirtyeight')